// let array = [1,2,3,4,5,5,6];

// let sum = array.reduce(() => {
//     return acc + cur;
// }, 0);
// console.log(sum);

// array.map((el) => {
//     let h1 = document.createElement("h1");
//     h1.textContent = el;
//     document.body.appendChild(h1);
// });


// 1. შექმენით do while ციკლი, რომელიც გამოტანს რიცხვებს 1-დან 10-მდე.
// let index = 1;
// do {
//     console.log(index);
//     index++;
// } while (index <= 10);

// 2. დაწერეთ do while ციკლი, რომელიც მოითხოვს მომხმარებლის სახელის შეყვანას მანამ, სანამ ტექსტში "გთხოვთ" არ იქნება შეტანილი, გამოიყენეთ includes().
// let firstName;
// do {
//     firstName = prompt("გთხოვთ შეიყვანოთ თქვენი სახელი");
// } while (!firstName.includes("გთხოვთ"));

// 3. შექმენით do while ციკლი, რომელიც შემთხვევითი რიცხვების გენერაციას გააგრძელებს მანამ, სანამ არ გამოიტანთ რიცხვს 5.
// let number;
// do {
//     number = Math.floor(Math.random() * 10);
//     console.log(number);
// } while (number === 5);

// 4. შექმენით do while ციკლი, რომელიც მომხმარებელს კითხავს ასაკს მინიმუმ ერთხელ, და ციკლს აგრძელებს, სანამ ასაკი არ იქნება 18-ზე მეტი.
// let age;
// do {
//     age = prompt ("რამდენი წლის ბრაძანდები?");
// } while (age <= 18);

// 5. შექმენით მასივი სახელებით და გამოიყენეთ forEach, რომ დააბეჭდოთ თითოეული სახელი.
// let array = ["George", "Nino", "Sopo", "Sandro"];
// array.forEach(saxeli => console.log(saxeli));


// 6. შექმენით რიცხვების მასივი და forEach-ით მოიმატეთ თითოეული ელემენტი 2-ით, შემდეგ კი დააბეჭდეთ.
// let array = [1,2,3,4,5,5,6];
// array.forEach(num => console.log(num + 2));

// 7. შექმენით რიცხვების მასივი და გამოიყენეთ map, რომ მიიღოთ ახალი მასივი, სადაც თითოეული რიცხვი გაორმაგებულია.
// let array = [1,2,3,4,5,5,6];
// array.map(num => console.log(num * 2));

// 8. დაწერეთ კოდი, რომელიც გამოიყენებს map-ს სახელების მასივში და მიიღებთ ახალ მასივს, სადაც ყველა სახელი დიდ ასოებადაა გადაყვანილი.
// let array = ["george", "nino", "sopo", "sandro"];
// array.map(saxeli => console.log(saxeli.toUpperCase()));

// 9. შექმენით მასივი price მნიშვნელობებით და map-ის დახმარებით გამოთვალეთ ფასების 10%-იანი დისკონტი და ახალი ფასები შეინახეთ ახალ მასივში.
// let array = [10,20,30,40,50,50,60];
// array.map(price => console.log(price - (price * 10 / 100)));

// 10. შექმენით ობიექტების მასივი, რომლებიც შეიცავენ პროდუქტებსა და მათ რაოდენობას. map-ის გამოყენებით, შექმენით ახალი მასივი, სადაც მხოლოდ პროდუქტის სახელებია.
let array = [{saxeli: "კაბა", raodenoba: 10},{saxeli: "შარვალი", raodenoba: 10}, {saxeli: "პიჯაკი", raodenoba: 10}, {saxeli: "ჟილეტი", raodenoba: 10}];
array.map(product => console.log(product.saxeli));

// 11. დაწერეთ map ფუნქცია, რომელიც მიიღებს ტექსტების მასივს და თითოეულ სიტყვაში პირველ ასოს დიდი ასოებით დაბეჭდავს.

// 12. შექმენით რიცხვების მასივი და filter ფუნქციის გამოყენებით მიიღეთ მხოლოდ ლუწი რიცხვები.

// 13. შექმენით სიტყვების მასივი და filter-ის გამოყენებით მიიღეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე 5-ზე მეტია.

// 14. დაწერეთ პროგრამა, რომელიც ფილტრავს რიცხვების მასივს და დააბრუნებს მხოლოდ 0-ზე ნაკლებ რიცხვებს.
